Rails/assignment1/app/controllers/users_controller.rb

  def index
    @page = params.fetch(:page,0).to_i
    if params[:search]
      @users_count = User.where('lower(first_name) LIKE ?', "%#{params[:search].downcase}%").count
      @users = User.where('lower(first_name) LIKE ?', "%#{params[:search].downcase}%").order(:id).offset(@page * RECORDS_PER_PAGE).limit(RECORDS_PER_PAGE)
    else
      @users_count = User.all.count
      @users = User.all.order(:id).offset(@page * RECORDS_PER_PAGE).limit(RECORDS_PER_PAGE)
---
SELECT COUNT(*) FROM "users" WHERE (lower(first_name) LIKE '%wong%')
SELECT "users".* FROM "users" WHERE (lower(first_name) LIKE '%a%') ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 10]]

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "gender", "avatar", "about", "email", "state", "created_at", "updated_at", "hobbys", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @user = User.find(params[:id])
    @user.update user_params
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 346], ["LIMIT", 1]]
UPDATE "users" SET "gender" = $1, "updated_at" = $2, "password_digest" = $3 WHERE "users"."id" = $4  [["gender", "Male"], ["updated_at", "2022-07-11 11:30:26.302725"], ["password_digest", "[FILTERED]"], ["id", 346]]

  def api
    @page =  params[:page]
    url = "https://reqres.in/api/users?page=#{@page}"
    response = RestClient.get(url)
    data_h = JSON.parse(response)
    print data_h.keys
    @counter = 0
    @note = []
    data_h['data'].each do |user|
      @id         = user['id']
      @email      = user['email']
      @first_name = user['first_name']
      @last_name  = user['last_name']
      @avatar     = user['avatar']
      if User.where("id = ?", @id).count == 1
        @user = User.find(@id)
        @user.update(email: @email, first_name: @first_name, last_name: @last_name, avatar: @avatar)
      else
        @user = User.new(id: @id, email: @email, first_name: @first_name, last_name: @last_name, avatar: @avatar)
      end
      if @user.save
        @note << @user.first_name
---
SELECT COUNT(*) FROM "users" WHERE (id = 1)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("id", "first_name", "last_name", "gender", "avatar", "about", "email", "password", "state", "created_at", "updated_at", "hobbys") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "users" ("id", "first_name", "last_name", "gender", "avatar", "about", "email", "state", "created_at", "updated_at", "hobbys", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"