Rails/avatar/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY id
---
  def index
    @users = User.all.order("id")

INSERT INTO "users" ("name", "gender", "avatar", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "shubhamjain0197@gmail.com"], ["gender", "assa"], ["avatar", "2"], ["address", "asasas"], ["created_at", "2022-07-13 11:24:39.031616"], ["updated_at", "2022-07-13 11:24:39.031616"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "Screenshot_from_2022-04-18_21-39-25.png"], ["updated_at", "2022-07-14 13:41:10.255258"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    @user.update user_params

SELECT "users".* FROM "users" ORDER BY address desc
---
  def sorting
    previous_sort_by = params[:previous_sort_by]
    sort_by = params[:sort_by]
    sort_type = params[:sort_type]

    if previous_sort_by == sort_by
      if sort_type == 'asc'
        sort_type = 'desc'
        params[:sort_type] = 'desc'
      else
        sort_type = 'asc'
        params[:sort_type] = 'asc'
      end
    end
    @users = User.all.order(sort_by+" "+sort_type)