Rails/assignment1/lib/tasks/import.rake

  task users: :environment do
    counter = 0
    filename = File.join Rails.root, "users.csv"
    CSV.foreach(filename, headers: true, header_converters: :symbol) do |row|
      user = User.where(email: row[:email]).first_or_initialize
      user.assign_attributes row.to_hash.slice(:last_name, :first_Name, :password)
      if user.save
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-12 12:06:19.961147"], ["password_digest", "[FILTERED]"], ["id", 353]]