Rails/assignment1/lib/tasks/import.rake

  task users: :environment do
    counter = 0
    filename = File.join Rails.root, "users.csv"
    CSV.foreach(filename) do |row|
      email, password, first, last = row
      user = User.create(email: email, first_name: first, last_name: last, password: password)
      counter += 1 if user.persisted?
      puts "#{email} - #{user.errors.full_messages.join(",")}" if user.errors.any?
---
INSERT INTO "users" ("first_name", "last_name", "gender", "avatar", "about", "email", "state", "created_at", "updated_at", "hobbys", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "as12df@ads.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "as12df@ads.com"], ["LIMIT", 1]]