Rails/assignment1/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "as12df@ads.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-12 12:18:40.505785"], ["password_digest", "[FILTERED]"], ["id", 353]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def self.import(file)
    counter = 0
    CSV.foreach(file.path, headers: true, header_converters: :symbol) do |row|
      user = User.where(email: row[:email]).first_or_initialize
      user.assign_attributes row.to_hash.slice(:last_name, :first_Name, :password)
      if user.save
        counter += 1
      else
        puts "#{row["Email"]} - #{user.errors.full_messages.join(",")}"

SELECT "users".* FROM "users"
---
  def self.to_csv
    attributes = %w{id email first_name last_name}
    #shortcut to create array of strings
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |user|