Ruby/Rails/ecommerce/app/controllers/customrs_controller.rb

  def index
    @customrs = Customr.all
---
SELECT "customrs".* FROM "customrs"

  def create
    @customr = Customr.new(customr_params)

    respond_to do |format|
      if @customr.save
---
INSERT INTO "customrs" ("name", "mobile_number", "email_address", "DOB", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Shubham"], ["mobile_number", "999999"], ["email_address", 3], ["DOB", "2022-05-11"], ["created_at", "2022-05-24 12:23:28.305464"], ["updated_at", "2022-05-24 12:23:28.305464"]]

  def destroy
    @customr.destroy
---
DELETE FROM "customrs" WHERE "customrs"."id" = $1  [["id", 1]]

    def set_customr
      @customr = Customr.find(params[:id])
---
SELECT "customrs".* FROM "customrs" WHERE "customrs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]