Rails/ecommerce/app/controllers/customrs_controller.rb

  def index
    @customrs = Customr.all
---
SELECT "customrs".* FROM "customrs"

  def create
    @customr = Customr.new(customr_params)

    respond_to do |format|
      if @customr.save
---
INSERT INTO "customrs" ("name", "mobile_number", "email_address", "DOB", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "MyString"], ["mobile_number", "MyString"], ["email_address", 1], ["DOB", "2022-05-24"], ["created_at", "2022-05-24 14:42:18.555837"], ["updated_at", "2022-05-24 14:42:18.555837"]]

  def destroy
    @customr.destroy
---
DELETE FROM "customrs" WHERE "customrs"."id" = $1  [["id", 980190962]]

    def set_customr
      @customr = Customr.find(params[:id])
---
SELECT "customrs".* FROM "customrs" WHERE "customrs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]