Rails/question_bank/app/controllers/omniauth_callbacks_controller.rb

  def twitter
    Rails.logger.info auth

    twitter_account = Current.user.twitter_accounts.where(username: auth.extra.access_token.params[:screen_name]).first_or_initialize
---
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 AND "twitter_accounts"."username" = $2 ORDER BY "twitter_accounts"."id" ASC LIMIT $3  [["user_id", 2], ["username", "2901855998"], ["LIMIT", 1]]