Rails/question_bank/app/controllers/password_resets_controller.rb

  def update
    @user = User.find_signed(params[:token], purpose: "password_reset")
    if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2022-06-30 13:36:02.375199"], ["id", 4]]