Rails/question_bank/app/controllers/twitter_accounts_controller.rb

  def destroy
    @twitter_account = Current.user.twitter_accounts.find(params[:id])
    @twitter_account.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 AND "twitter_accounts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "twitter_accounts" WHERE "twitter_accounts"."id" = $1  [["id", 4]]

  def set_twitter_account
    @twitter_account = Current.user.twitter_accounts.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 AND "twitter_accounts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 7], ["LIMIT", 1]]