Rails/question_bank/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "shubhamjain0197@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-06-30 08:18:51.138242"], ["updated_at", "2022-06-30 08:18:51.138242"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2022-06-30 08:40:11.464680"], ["id", 4]]
---
  def update
    if Current.user.update(password_params)