Rails/question_bank/app/views/users/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  <div class="alert alert-danger">
    <% Current.user.errors.full_messages.each do |message| %>