Rails/assignment1/app/controllers/api/v1/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
  def index
    assignments = Assignment.all

INSERT INTO "assignments" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "samuel2"], ["user_id", 349], ["created_at", "2022-07-11 14:35:06.599355"], ["updated_at", "2022-07-11 14:35:06.599355"]]
---
  def create

      assignment = Assignment.create(
        name: params[:name],
        user: @user
      )