Rails/assignment1/app/controllers/api/v1/assignments_controller.rb

  def create
    authorization_header = request.headers[:authorization]

    if !authorization_header
      render status: :unauthorized
    else
      token = authorization_header.split("")[1][0]
      secret_key = Rails.application.secrets.secret_key_base[0]
      decoded_token = JWT.decode(token, secret_key)[0]

      user = User.find(decoded_token["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 349], ["LIMIT", 1]]