Rails/assignment1/app/controllers/api/v1/authentications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asdd@gmail.coms"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email])