Rails/assignment1/app/controllers/api/v1/users_controller.rb

  def index
    users = User.all.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def create
    user = User.new user_params
    if user.save
---
INSERT INTO "users" ("first_name", "last_name", "gender", "avatar", "about", "email", "state", "created_at", "updated_at", "hobbys", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    user = User.find(params[:id])
    user.update user_params
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-11 12:01:51.365882"], ["password_digest", "[FILTERED]"], ["id", 348]]