Rails/simple_content_management_system/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."last_name" ASC, "users"."first_name" ASC
---
  def index
    @users = User.order(:last_name, :first_name)

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Shubham"], ["last_name", "Jain"], ["email", "shubhamjain0197@gmail.com"], ["created_at", "2022-06-21 17:46:45.555511"], ["updated_at", "2022-06-21 17:46:45.555511"]]
---
  def create
    @user = User.new(user_params)
    if @user.save