Rails/simple_content_management_system/app/views/users/new.html.erb

      	<td>
      		<% collection = Department.all %>
---
SELECT "departments".* FROM "departments"