Rails/question_bank/app/controllers/api/v1/twitter_accounts_controller.rb

  def index
    twitter_accounts = TwitterAccount.all
---
SELECT "twitter_accounts".* FROM "twitter_accounts"

  def show
    twitter_account = TwitterAccount.find_by(id: params[:id])
---
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]

  def create
    twitter_accounts = TwitterAccount.new twitter_account_params
    if twitter_accounts.save
---
INSERT INTO "twitter_accounts" ("user_id", "name", "username", "image", "token", "secret", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    twitter_account = TwitterAccount.find_by(id: params[:id])
    twitter_account.destroy
---
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
DELETE FROM "twitter_accounts" WHERE "twitter_accounts"."id" = $1  [["id", 44]]